:PROPERTIES:
:ID:       027166e4-fbcc-4c75-8990-8198c7a47ae4
:END:
#+title: Cheatsheet: Frr vtysh commands

*** Yang Lint

#+begin_src shell :results output verbatim
guix shell frrouting libyang
export YANGPATH=$GUIX_ENVIRONMENT/share/yang
yanglint -p $YANGPATH -f tree $YANGPATH/frr-staticd.yang
# or XML with -f yin
# yanglint -p $YANGPATH -f yang $YANGPATH/frr-staticd.yang
# yanglint -p $YANGPATH -f yin $YANGPATH/frr-staticd.yang
#+end_src

#+RESULTS:
#+begin_example
module: frr-staticd

  augment /frr-rt:routing/frr-rt:control-plane-protocols/frr-rt:control-plane-protocol:
    +--rw staticd
       +--rw route-list* [prefix src-prefix afi-safi]
       |  +--rw prefix                       inet:ip-prefix
       |  +--rw src-prefix                   inet:ipv6-prefix
       |  +--rw afi-safi                     identityref
       |  +---u staticd-prefix-attributes
       +--rw segment-routing
          +--rw srv6
             +--rw static-sids
                +--rw sid* [sid]
                   +--rw sid             inet:ipv6-prefix
                   +--rw behavior?       srv6-behavior-codepoint
                   +--rw locator-name?   string
                   +--rw vrf-name?       frr-vrf:vrf-ref
#+end_example

Validate an instance

#+begin_src shell :results output verbatim
guix shell frrouting libyang
topoTests=/data/ecto/vyos/frr/tests/topotests
staticJson=$frrPath/$topoTests/bfd_topo3/r3/bfd-static.json
export YANGPATH=$GUIX_ENVIRONMENT/share/yang

echo -e "\n\ninvalid: (top-level not fully-qualified)"
    yanglint -p $YANGPATH -f json $YANGPATH/frr-staticd.yang $staticJson 2>&1

echo -e "\n\nvalid: (no error)"
cat $staticJson | jq '{"frr-staticd:path-list": ."path-list"}' |
    yanglint -p $YANGPATH -f json $YANGPATH/frr-staticd.yang 2>&1

echo -e "\ninvalid: (not even wrong) "
yanglint -p $YANGPATH -f json $YANGPATH/frr-staticd.yang '{}' 2>&1
#+end_src

#+RESULTS:
#+begin_example


invalid: (top-level not fully-qualified)
libyang err : Top-level JSON object member "path-list" must be namespace-qualified. (line 2)
YANGLINT[E]: Failed to parse input data file "//data/ecto/vyos/frr/tests/topotests/bfd_topo3/r3/bfd-static.json".


valid: (no error)

invalid: (not even wrong)
YANGLINT[E]: Input schema format for {} file not recognized.
#+end_example

*** FRR Modules

+idk really what to do with these (something with RelaxNG, I think).+

#+begin_src shell
guix shell frrouting
ls $GUIX_ENVIRONMENT/share/yang/* | sed -e 's/.*share\/yang\///g'
#+end_src

#+RESULTS:
| frr-affinity-map.yang              |
| frr-backend.yang                   |
| frr-bfdd.yang                      |
| frr-bgp-bmp.yang                   |
| frr-bgp-common-multiprotocol.yang  |
| frr-bgp-common-structure.yang      |
| frr-bgp-common.yang                |
| frr-bgp-filter.yang                |
| frr-bgp-neighbor.yang              |
| frr-bgp-peer-group.yang            |
| frr-bgp-route-map.yang             |
| frr-bgp-rpki.yang                  |
| frr-bgp-types.yang                 |
| frr-bgp.yang                       |
| frr-deviations-bgp-datacenter.yang |
| frr-deviations-ietf-key-chain.yang |
| frr-eigrpd.yang                    |
| frr-filter.yang                    |
| frr-gmp.yang                       |
| frr-if-rmap.yang                   |
| frr-interface.yang                 |
| frr-isisd.yang                     |
| frr-module-translator.yang         |
| frr-nexthop.yang                   |
| frr-ospf6-route-map.yang           |
| frr-ospfd.yang                     |
| frr-ospf-route-map.yang            |
| frr-pathd.yang                     |
| frr-pim-candidate.yang             |
| frr-pim-rp.yang                    |
| frr-pim.yang                       |
| frr-ripd.yang                      |
| frr-ripngd.yang                    |
| frr-route-map.yang                 |
| frr-route-types.yang               |
| frr-routing.yang                   |
| frr-staticd.yang                   |
| frr-test-module.yang               |
| frr-vrf.yang                       |
| frr-vrrpd.yang                     |
| frr-zebra-route-map.yang           |
| frr-zebra.yang                     |
| ietf-bgp-types.yang                |
| ietf-interfaces.yang               |
| ietf-key-chain.yang                |
| ietf-netconf-acm.yang              |
| ietf-netconf-with-defaults.yang    |
| ietf-netconf.yang                  |
| ietf-routing-types.yang            |

*** Node Types

By example

#+begin_src shell
# LOL that's a work of art
grep -e 'kind: ' /data/ecto/vyos/srl-labs/containerlab/lab-examples/**/*.yml  \
    | rev | sort | sed -e 's/.*:dnik.*:\(lmy.*\)\/sel.*/\1/g' \
    | rev | uniq -c
#+end_src

#+RESULTS:
|  1 | srlvjunos02/srlvjunos02.clab.yml |
|  2 | k8s_kind01/k8s_kind01.clab.yml   |
|  1 | srlcrpd01/srlcrpd01.clab.yml     |
|  1 | srlxrd01/srlxrd01.clab.yml       |
|  1 | freebsd01/freebsd01.clab.yml     |
|  1 | openbsd01/openbsd01.yml          |
|  1 | br01/br01.clab.yml               |
|  1 | ixiac01/ixiac01.clab.yml         |
|  2 | fortigate/fortigate.clab.yml     |
|  1 | srlvjunos01/srlvjunos01.clab.yml |
|  1 | vr04/vr04.clab.yml               |
|  1 | generic_vm01/generic_vm.clab.yml |
|  3 | k8s_kind01/k8s_kind01.clab.yml   |
|  1 | srlceos01/srlceos01.clab.yml     |
|  1 | vr01/vr01.clab.yml               |
|  1 | vr05/vr01.clab.yml               |
|  1 | cert01/cert01.clab.yml           |
|  1 | vr05/sros4.clab.yml              |
|  1 | vxlan01/vxlan-sros.clab.yml      |
|  1 | sonic01/sonic01.clab.yml         |
|  1 | ftdv01/ftdv01.yml                |
|  1 | vr03/vr03.clab.yml               |
|  1 | vr02/vr02.clab.yml               |
|  1 | vxlan01/vxlan-vmx.clab.yml       |
|  1 | vsrx01/vsrx01.yml                |
|  2 | openbsd01/openbsd01.yml          |
|  2 | ftdv01/ftdv01.yml                |
|  2 | vsrx01/vsrx01.yml                |
|  2 | freebsd01/freebsd01.clab.yml     |
|  6 | frr01/frr01.clab.yml             |
|  1 | srlfrr01/srlfrr01.clab.yml       |
|  2 | clos01/clos01.clab.yml           |
|  4 | clos02/clos02.clab.yml           |
|  4 | clos02/setup.clos02.clab.yml     |
|  4 | srl03/srl03.clab.yml             |
|  1 | ost-srl/ost-srl.clab.yml         |
|  1 | cvx01/topo.clab.yml              |
|  1 | cvx02/topo.clab.yml              |
|  1 | ixiac01/ixiac01.clab.yml         |
|  1 | sonic01/sonic01.clab.yml         |
|  1 | k8s_kind01/k8s_kind01.clab.yml   |
|  1 | srlcrpd01/srlcrpd01.clab.yml     |
|  1 | srlxrd01/srlxrd01.clab.yml       |
|  1 | srl01/srl01.clab.yml             |
|  1 | srl-quickstart/srl01.clab.yml    |
|  3 | br01/br01.clab.yml               |
|  1 | srlfrr01/srlfrr01.clab.yml       |
|  1 | vr01/vr01.clab.yml               |
|  1 | vr05/vr01.clab.yml               |
|  1 | srlceos01/srlceos01.clab.yml     |
|  3 | clos01/clos01.clab.yml           |
|  1 | srlvjunos01/srlvjunos01.clab.yml |
|  2 | srl02/srl02.clab.yml             |
|  2 | srl-quickstart/srl02.clab.yml    |
|  1 | vr02/vr02.clab.yml               |
| 10 | clos02/clos02.clab.yml           |
| 10 | clos02/setup.clos02.clab.yml     |
|  1 | srlvjunos02/srlvjunos02.clab.yml |
|  4 | srl03/srl03.clab.yml             |
|  1 | vr03/vr03.clab.yml               |
|  1 | vr04/vr04.clab.yml               |
|  1 | ost-srl/ost-srl.clab.yml         |
|  1 | generic_vm01/generic_vm.clab.yml |
|  1 | cvx01/topo.clab.yml              |
|  1 | cvx02/topo.clab.yml              |

count by =kind=

#+begin_src shell
grep -e 'kind: ' /data/ecto/vyos/srl-labs/containerlab/lab-examples/**/*.yml  \
    | rev | sort | sed -e 's/ :dnik.*//g' \
    | rev | uniq -c
#+end_src

#+RESULTS:
|  1 | juniper_vjunosevolved |
|  2 | k8s-kind              |
|  1 | juniper_crpd          |
|  1 | cisco_xrd             |
|  1 | freebsd               |
|  1 | openbsd               |
|  1 | bridge                |
|  1 | keysight_ixia-c-one   |
|  2 | fortinet_fortigate    |
|  1 | juniper_vjunosswitch  |
|  1 | cisco_xrv9k           |
|  1 | generic_vm            |
|  3 | ext-container         |
|  1 | arista_ceos           |
|  5 | nokia_sros            |
|  1 | sonic-vs              |
|  1 | cisco_ftdv            |
|  1 | cisco_xrv             |
|  2 | juniper_vmx           |
|  1 | juniper_vsrx          |
|  8 | linux                 |
| 17 | linux                 |
|  4 | linux                 |
|  3 | linux                 |
| 52 | nokia_srlinux         |
|  2 | cumulus_cvx           |


